{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "AV-8B Harrier II",
    "1": "Airbus A220",
    "10": "Boeing B-17 Flying Fortress",
    "11": "Boeing B-29 Superfortress",
    "12": "Boeing B-52 stratofortress",
    "13": "Boeing B737",
    "14": "Boeing B747",
    "15": "Boeing B767",
    "16": "Boeing B777",
    "17": "Boeing B787",
    "18": "Boeing C-17 Globemaster III",
    "19": "Boeing F-18 Super Hornet",
    "2": "Airbus A318",
    "20": "Eurofighter Typhoon",
    "21": "Fairchild Republic A-10 Warhog",
    "22": "Grumman F-14",
    "23": "Lockheed C-5 Galaxy",
    "24": "Lockheed Martin C-130 Hercules",
    "25": "Lockheed Martin F-16 Viper",
    "26": "Lockheed Martin F-22 Raptor",
    "27": "Lockheed Martin F-35 Lightning",
    "28": "Lockheed P-38 Lightning",
    "29": "McDonnell Douglas F-15 Eagle",
    "3": "Airbus A319",
    "30": "North American P51 Mustang",
    "31": "Northrop B-2 Spirit",
    "32": "Rockwell B-1B Lancer",
    "33": "Saab JAS39",
    "4": "Airbus A350",
    "5": "Airbus A380",
    "6": "Airbus A400M Atlas",
    "7": "Avro Lancaster",
    "8": "Bell Boeing V-22 Osprey",
    "9": "Boeing AH-64 Apache"
  },
  "image_size": 384,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "AV-8B Harrier II": "0",
    "Airbus A220": "1",
    "Airbus A318": "2",
    "Airbus A319": "3",
    "Airbus A350": "4",
    "Airbus A380": "5",
    "Airbus A400M Atlas": "6",
    "Avro Lancaster": "7",
    "Bell Boeing V-22 Osprey": "8",
    "Boeing AH-64 Apache": "9",
    "Boeing B-17 Flying Fortress": "10",
    "Boeing B-29 Superfortress": "11",
    "Boeing B-52 stratofortress": "12",
    "Boeing B737": "13",
    "Boeing B747": "14",
    "Boeing B767": "15",
    "Boeing B777": "16",
    "Boeing B787": "17",
    "Boeing C-17 Globemaster III": "18",
    "Boeing F-18 Super Hornet": "19",
    "Eurofighter Typhoon": "20",
    "Fairchild Republic A-10 Warhog": "21",
    "Grumman F-14": "22",
    "Lockheed C-5 Galaxy": "23",
    "Lockheed Martin C-130 Hercules": "24",
    "Lockheed Martin F-16 Viper": "25",
    "Lockheed Martin F-22 Raptor": "26",
    "Lockheed Martin F-35 Lightning": "27",
    "Lockheed P-38 Lightning": "28",
    "McDonnell Douglas F-15 Eagle": "29",
    "North American P51 Mustang": "30",
    "Northrop B-2 Spirit": "31",
    "Rockwell B-1B Lancer": "32",
    "Saab JAS39": "33"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "5.9.0",
  "use_cache": false
}
